## Plan Result (883: stg_landing - TerraformPlanApply)




<pre><code>Plan: 0 to add, 19 to change, 0 to destroy.</code></pre>

* Update
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;logic&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;main&#34;]
  * module.logic[&#34;05&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;05&#34;].azurerm_service_plan.this
  * module.logic[&#34;05&#34;].azurerm_storage_account.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.logic[&#34;05&#34;].module.application_insights.azurerm_application_insights.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["05"].azurerm_resource_group.this["logic"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-logic-stg"
        name       = "ingest05-logic-stg"
      ~ tags       = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
          - "expiresAfter"        = "3000-01-01" -> null
            "startupMode"         = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.data_landing_zone["05"].azurerm_resource_group.this["main"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg"
        name       = "ingest05-main-stg"
      ~ tags       = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
          - "expiresAfter"        = "3000-01-01" -> null
            "startupMode"         = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.logic["05"].azurerm_logic_app_standard.this will be updated in-place
  ~ resource "azurerm_logic_app_standard" "this" {
      ~ app_settings                             = {
          + "APPINSIGHTS_CONNECTION_STRING"         = (sensitive value)
          - "APPLICATIONINSIGHTS_CONNECTION_STRING" = "InstrumentationKey=14441f56-e76e-43bb-9e73-680af0a876c4;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/;ApplicationId=62a9a4c5-fa98-4205-8af6-81220725f1f7" -> null
            # (8 unchanged elements hidden)
        }
      ~ https_only                               = true -> false
        id                                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-logic-stg/providers/Microsoft.Web/sites/ingest05-logic-stg"
        name                                     = "ingest05-logic-stg"
      ~ tags                                     = {
          + "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
            "environment"         = "staging"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["05"].azurerm_service_plan.this will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-logic-stg/providers/Microsoft.Web/serverFarms/ingest05-app-service-plan-stg"
        name                            = "ingest05-app-service-plan-stg"
      ~ tags                            = {
          + "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
            "environment"         = "staging"
        }
        # (12 unchanged attributes hidden)
    }

  # module.logic["05"].azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ allow_nested_items_to_be_public    = false -> true
      ~ default_to_oauth_authentication    = true -> false
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-logic-stg/providers/Microsoft.Storage/storageAccounts/ingest05logicstg"
        name                               = "ingest05logicstg"
      ~ public_network_access_enabled      = false -> true
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
        }
        # (94 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS DLRM Data Ingestion Admin (env:staging)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                           = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-stg"
        name                                         = "ingest00-metadata-mssql-stg"
        tags                                         = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (16 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "8a6b48b2-9d46-436c-a233-5f4eaf82a0c9" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_databricks.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_databricks.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00curatedstg"
        name                               = "ingest00curatedstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "86.186.79.105",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00externalstg"
        name                               = "ingest00externalstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"
        name                               = "ingest00landingstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00rawstg"
        name                               = "ingest00rawstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["sftp"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00workspacestg"
        name                               = "ingest00workspacestg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.metadata_mssql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS DLRM Data Ingestion Admin (env:staging)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["05"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["05"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                           = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Sql/servers/ingest05-metadata-mssql-stg"
        name                                         = "ingest05-metadata-mssql-stg"
        tags                                         = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (16 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "8a6b48b2-9d46-436c-a233-5f4eaf82a0c9" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["05"].module.metadata_mysql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["05"].module.metadata_mysql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["05"].module.metadata_mysql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.runtimes_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["05"].module.runtimes_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.shared_integration_databricks.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["05"].module.shared_integration_databricks.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.shared_integration_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["05"].module.shared_integration_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.shared_integration_datafactory.azurerm_data_factory.this will be updated in-place
  ~ resource "azurerm_data_factory" "this" {
        id                               = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.DataFactory/factories/ingest05-integration-dataFactory001-stg"
        name                             = "ingest05-integration-dataFactory001-stg"
      + purview_id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-rg-stg/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-stg"
      ~ tags                             = {
          + "Data-Ingest-Project" = "Crime Legacy Migration"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "staging"
          + "startupMode"         = "always"
        }
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["curated"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05curatedstg"
        name                               = "ingest05curatedstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["external"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05externalstg"
        name                               = "ingest05externalstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["landing"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05landingstg"
        name                               = "ingest05landingstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05rawstg"
        name                               = "ingest05rawstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["05"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["05"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-main-stg/providers/Microsoft.Storage/storageAccounts/ingest05workspacestg"
        name                               = "ingest05workspacestg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.logic["05"].module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest05-logic-stg/providers/Microsoft.Insights/components/data-landing-stg"
      ~ internet_query_enabled                = false -> true
        name                                  = "data-landing-stg"
      ~ tags                                  = {
          + "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
            "environment"         = "staging"
        }
        # (15 unchanged attributes hidden)
    }

Plan: 0 to add, 19 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 883: stg_landing - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":127,"Program":"tfcmt","SHA1":"","Target":"883: stg_landing - TerraformPlanApply","Vars":{}} -->